DB_PATH = './database.db'
DB_DATA = [
    (101, 'Иванов И.И.', '1975-05-12', 'director', 'doctor', 0, 80000),
    (102, 'Петров П.П.', '1980-11-23', 'regular', 'academic', 0, 65000),
    (103, 'Сидоров С.С.', '1990-01-15', 'regular', 'academic', 0, 50000),
    (104, 'Кузнецова А.А.', '1985-03-30', 'zavuch', 'doctor', 0, 75000),
    (105, 'Смирнов В.В.', '1978-07-08', 'regular', 'academic', 0, 55000),
    (106, 'Попова Е.М.', '1992-09-19', 'regular', 'academic', 0, 48000),
    (107, 'Васильев Н.Н.', '1965-12-01', 'director', 'doctor', 0, 95000),
    (108, 'Соколов Д.Г.', '1988-04-14', 'regular', 'academic', 0, 52000),
    (109, 'Новикова О.С.', '1982-06-25', 'zavuch', 'doctor', 0, 70000),
    (110, 'Морозов И.В.', '1995-02-10', 'regular', 'academic', 0, 45000)
]
